app/views/posts/_form.html.erb

SELECT "topics".* FROM "topics"
---
    <%= label(:post, :topic, "Choose tema") %>
    <%= select(:post, :topic, options_from_collection_for_select(@topics, "id", "title", @post.present? ? @post.id : nil), {}, {class: "form-control"}) %>