app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (id > 5) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @posts = Post.all()

SELECT "topics".* FROM "topics" WHERE "topics"."alias" = $1 LIMIT $2  [["alias", "design"], ["LIMIT", 1]]
---
  def topic
    @topic = Topic.find_by(alias: params[:topic])

SELECT "topics".* FROM "topics"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @topics = Topic.all()
    @post = Post.find(params[:id])

SELECT "topics".* FROM "topics"
---
  def new
    @topics = Topic.all()

INSERT INTO "posts" ("title", "body", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The new book"], ["body", "new book new book new book"], ["topic_id", 5], ["created_at", "2020-09-18 13:51:08.624645"], ["updated_at", "2020-09-18 13:51:08.624645"]]
SELECT "topics".* FROM "topics"
---
  def create
   # @post = Post.new(params.require(:post).permit(:title, :body, :topic_id))
    @post = Post.new(post_params)
    if @post.save
      redirect_to '/posts/' + @post.id.to_s
    else
      @topics = Topic.all()

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "topic_id" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["body", "more or less all right..."], ["topic_id", 3], ["updated_at", "2020-09-18 13:59:48.947237"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)