app/models/comment.rb

    def self.replies_for_post(post_id)
        # SELECT "comments".* FROM "comments" WHERE (post_id = 20 and parent_id != 0) ORDER BY parent_id, id
        Comment.where("post_id = ? and parent_id != 0", post_id).order(["parent_id", "id"]).group_by { |comment| comment["parent_id"] }
---
SELECT "comments".* FROM "comments" WHERE (post_id = 1 and parent_id != 0) ORDER BY parent_id, id